# To install, run: brew bundle install --file=Brewfile

tap "homebrew/bundle"

# Editor support.
brew "neovim"
brew "lua-language-server"
brew "luajit"
brew "luarocks"

# Command-line tools.
brew "fzf"
brew "fd"
brew "gnupg"
brew "pinentry-mac"
brew "ripgrep"
brew "tmux"
brew "xz"

# Gopher, Gemini, Web browsers.
tap "xvxx/code"
brew "amfora"
brew "lynx"

# Developer tools.
brew "gh"
brew "jj"
brew "jq"
brew "tig"

# Build systems.
brew "bazelisk"
brew "ninja"

# Programming languages, build systems.
brew "go"
brew "llvm"
brew "pipx"
brew "python@3.11"

# Libraries.
brew "libgit2"

# Accounting.
brew "beancount"
brew "beancount-language-server"
brew "fava"

# Blogging.
brew "hugo"
